
/* Норма. Task 1
Напиши функцію, яка перевіряє, чи є передане їй число “досконалим числом”.
Досконале число - це число, яке дорівнює сумі всіх своїх дільників. */


// Получаем число от пользователя:
//let a = Number(prompt("Enter the number"));

function isPerfectNumber(a) {

    let result = 0;
    // Делаем цикл от 1 до заданного числа
    for (let i = 1; i <= a; i++) {

        // длбавляем условие: если наше число делится без остатк ана делитель И делитель НЕ равен числу, то суммируем этоо делитель
        if (a % i == 0 && a !== i) {
            result = result + i;
        }
    }

    // Сравниваем сумму всех делителей с заданным числом, если они равны, то Число- совершенное
    if (a == result) {
        return true
    }
    else {
        return false
    }
}


/* if (isPerfectNumber(a)) { console.log("Ваше число совершенное") }
else { console.log("Ваше число НЕ совершенное") } */


/// Конец первой заддачи


/* Task 2
Напиши функцію, яка приймає мінімальне і максимальне значення для діапазону, і виводить тільки ті числа з діапазону, які є досконалими.
Використовуй написану раніше функцію, щоб дізнатися, чи є це число досконалим. */

let a = Number(prompt("Enter the first number"));
let b = Number(prompt("Enter the second number"));


// Делаем цикл. Проверяем, если a<b, тогда делаем цикл от  a до b, если b<a, тогда цикл от b до a
for (let i = (a > b ? b : a); i <= (a > b ? a : b); i++) {
    // используем функцию из предыдущей задачи
    if (isPerfectNumber(i)) { console.log(`Число ${i} совершенное`) }

}

// Конец второй задачи




//!! ДЛЯ ПРОВЕРКИ ЭТИХ ЗАДАЧ НУЖНО ПООЧЕРИ РАСКОММЕНТИРОВАТЬ КОД И ЗАПРОСОМ ПЕРЕМЕННЫХ И ВЫВОДОМ В КОНСОЛЬ!