/* Task 10

Игра «Угадай число». Предложить пользователю загадать число от 0 до 100 и отгадать его следующим способом:
каждую итерацию цикла делите диапазон чисел пополам, записываете результат в N
и спрашиваете у пользователя«Ваше число > N, < N или == N?».
В зависимости от того, что указал пользователь, уменьшаете диапазон. Начальный диапазон от 0 до 100, поделили пополам и получили 50.
Если пользователь указал, что его число > 50, то изменили диапазон на от 51 до 100.
И так до тех пор, пока пользователь не выберет == N. */

alert('Загадайте число от 0 до 100');

// задаем мин. и макс. занчение (0-100)
let minN = 0;
let maxN = 100;
// полученный диапазон днлим попалам
let N = (maxN - minN) / 2;

// Узнаем у пользователя еего число больше или меньше заданного диапазона
let b = prompt(`Ваше число больше? ${N} Yes/No/ItsMyNumber`);


// делаем цикл. До тех пор пока пользователь не скажет, что мы угадали его число
while (b !== "ItsMyNumber") {
    // Если уго число больше указанного диапазона, то меняем минимальную границу на середину диапазона
    if (b == "Yes") {
        minN = N;
    }
    // если число пользователя меньше, то меняем максимальную границу
    else {
        maxN = N;
    }

    // после того, как изменили границы диапазона, опять делим его пополам, и получаем новое значение N
    N = Math.round((maxN + minN) / 2);
    // после манипуляций снова задаем вопрос пользователю, и так ло тех пор пока он не ответит ItsMyNumber
    b = prompt(`Ваше число больше? ${N} Yes/No/ItsMyNumber`);
}

console.log(N);