/* Task 10

Игра «Угадай число». Предложить пользователю загадать число от 0 до 100 и отгадать его следующим способом:
каждую итерацию цикла делите диапазон чисел пополам, записываете результат в N
и спрашиваете у пользователя«Ваше число > N, < N или == N?».
В зависимости от того, что указал пользователь, уменьшаете диапазон. Начальный диапазон от 0 до 100, поделили пополам и получили 50.
Если пользователь указал, что его число > 50, то изменили диапазон на от 51 до 100.
И так до тех пор, пока пользователь не выберет == N. */

alert('Загадайте число от 0 до 100');


let minN = 0;
let maxN = 100;
let N = (maxN - minN) / 2;

let b = prompt(`Ваше число больше? ${N} Yes/No/ItsMyNumber`);

while (b !== "ItsMyNumber") {
    if (b == "Yes") {
        minN = N;
    }
    else {
        maxN = N;
    }

    N = Math.round((maxN + minN) / 2);
    b = prompt(`Ваше число больше? ${N} Yes/No/ItsMyNumber`);
}

console.log(N);