/* Task7
Запросить у пользователя число и на сколько цифр его сдвинуть.   
Сдвинуть цифры числа и вывести результат (если число 123456 сдвинуть на 2 цифры, то получится 345612). */

let a = prompt("Enter the number, please");
// Переводим строку в число, т.к. по нему будем делать цикл
let b = Number(prompt("How much shifts?"));

// Объявляем цикл с 1 по b 
// В цикле работаем со строкой. Первый операнд убирает первый символ строки
// второй операнд оставляет только первый символ, строки суммируются,
//т.о мы получаем новую строку со смещением на 1 символ
for (let i = 1; i <= b; i++) {
    a = a.substring(1, a.length) + a.substring(0, 1);
}
console.log(a);
