/* Task 8
Зациклить вывод дней недели таким образом: «День недели.Хотите увидеть следующий день?»
и так до тех пор, пока пользователь нажимает OK. */

// Получем текущую дату
let thisDay = new Date();

// вводим доп.параметр булевского типа
let nextData = true;

// До тех пор пока пользователь хочет выводить дату, продолжается цикл
while (nextData) {

    // к дате лобавляем + 1 день
    thisDay.setDate(thisDay.getDate() + 1);
    // выводим дату и задаем вопрос, желает ли пользователь продолжить. Ответ записывается в переменную булевского типа
    nextData = confirm(`Date: ${thisDay} Do you want to continue?`);
}